all-posts.org
#+HUGO_BASE_DIR: ./
#+SEQ_TODO: TODO DRAFT DONE

** DONE Notes about postgresql                          :database:postgresql:
  :PROPERTIES:
  :EXPORT_FILE_NAME: notes-about-postgresql
  :EXPORT_DATE: 2018-05-08
  :END:
*** How to generate and insert test data?
    For example, my table is like: ~create table (time timestamp, value double precision, sensor integer)~. If I want to insert some test data, I can use function ~generate_series~.
    Following sql will insert 5000 rows:
    #+begin_src sql
    insert into test (time, sensor, value) select now(), i, random() from generate_series(1, 5000) s(i)
    #+end_src
*** How to view disk usage?
**** View table size
     #+begin_src sql
     select pg_size_pretty(pg_relation_size('pressure_01'))
     #+end_src
**** View database size
     #+begin_src sql
     select pg_size_pretty(pg_database_size('pressure_01'))
     #+end_src
